hebertreis/taptosow/esp8266-arduino/src/main.cpp
    publishMessage(mqttTopicBase + "/debug", payload);
}

void publishReadModeStatus() {
    StaticJsonDocument<256> doc;
    doc["type"] = "read_mode_status";
    doc["deviceId"] = deviceId;
    doc["readModeEnabled"] = readMode;
    doc["timestamp"] = millis();

    String payload;
    serializeJson(doc, payload);

    publishMessage(mqttTopicBase + "/debug", payload);
}

// ============================================================================
// NFC TAG DATA READ
// ============================================================================

void publishTagData(const String& tagId, const String& ndefUrl) {
    StaticJsonDocument<1024> doc;
    doc["type"] = "tag_data";
    doc["deviceId"] = deviceId;
    doc["serialNumber"] = tagId;  // NFC serial number (UID)
    doc["timestamp"] = millis();

    // NDEF section
    JsonObject ndef = doc.createNestedObject("ndef");

    // Try to read NDEF message for rich data
    NfcTag tag = nfc.read();
    if (tag.hasNdefMessage()) {
        NdefMessage message = tag.getNdefMessage();
        ndef["hasMessage"] = true;
        ndef["recordCount"] = message.getRecordCount();

        JsonArray records = ndef.createNestedArray("records");
        for (int i = 0; i < message.getRecordCount(); i++) {
            NdefRecord record = message.getRecord(i);
            JsonObject recObj = records.createNestedObject();

            // Record type (TNF + type bytes)
            byte tnf = record.getTnf();
            recObj["tnf"] = tnf;

            // Type as string
            String typeStr = "";
            byte typeLen = record.getTypeLength();
            for (byte j = 0; j < typeLen; j++) {
                char c = record.getType()[j];
                if (c >= 32 && c < 127) typeStr += c;
            }
            recObj["type"] = typeStr;

            // Detect record kind
            if (tnf == 0x01 && typeLen == 1 && record.getType()[0] == 0x55) {
                // URI record
                recObj["kind"] = "URI";
                uint16_t payloadLen = record.getPayloadLength();
                if (payloadLen > 1) {
                    byte prefixCode = record.getPayload()[0];
                    String prefix = "";
                    switch(prefixCode) {
                        case 0x01: prefix = "http://www."; break;
                        case 0x02: prefix = "https://www."; break;
                        case 0x03: prefix = "http://"; break;
                        case 0x04: prefix = "https://"; break;
                        default: prefix = ""; break;
                    }
                    String uriPayload = prefix;
                    for (uint16_t j = 1; j < payloadLen; j++) {
                        char c = record.getPayload()[j];
                        if (c >= 32 && c < 127) uriPayload += c;
                    }
                    recObj["payload"] = uriPayload;
                    // Set top-level ndefUrl from first URI record
                    if (i == 0) doc["ndefUrl"] = uriPayload;
                }
            } else if (tnf == 0x01 && typeLen == 1 && record.getType()[0] == 0x54) {
                // Text record
                recObj["kind"] = "TEXT";
                String textPayload = "";
                uint16_t payloadLen = record.getPayloadLength();
                // First byte: language code length
                if (payloadLen > 0) {
                    byte langLen = record.getPayload()[0] & 0x3F;
                    for (uint16_t j = 1 + langLen; j < payloadLen; j++) {
                        char c = record.getPayload()[j];
                        if (c >= 32 && c < 127) textPayload += c;
                    }
                }
                recObj["payload"] = textPayload;
            } else {
                // Generic record - raw payload as printable
                recObj["kind"] = "UNKNOWN";
                String rawPayload = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen && j < 32; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) rawPayload += c;
                    else rawPayload += '.';
                }
                recObj["payload"] = rawPayload;
            }
        }
    } else {
        ndef["hasMessage"] = false;
        // If we already extracted URL before calling this function, include it
        if (ndefUrl.length() > 0) {
            doc["ndefUrl"] = ndefUrl;
        }
    }

    // Debug: read sector data if enabled
    if (debugMode) {
        String sectorData = readAllSectorData();
        if (sectorData.length() > 0) {
            doc["sectorData"] = sectorData;
        }
    }

    Serial.print(F("[NFC] Publishing tag data - UID: "));
    Serial.println(tagId);

    String payload;
    serializeJson(doc, payload);
    publishMessage(mqttTopicBase + "/result", payload);
}



String generateOneTapGoUrl(const String& tenantId, const String& sectorId) {
    // Generate URL based on tenant and sector
    // Format: https://onetapgo.site/a/{uniqueId}
    // The uniqueId should be generated and stored in Firestore
    
    // For now, use a combination of device ID and timestamp
    String uniqueId = deviceId + "_" + String(millis());
    return "https://onetapgo.site/a/" + uniqueId;
}

bool writeNfcTag(const String& tenantId, const String& sectorId, const String& url) {
    Serial.println(F("\n[NFC] Starting write process..."));
    displayShowState(STATE_WRITING);

    // Create NDEF message with URI record
    NdefMessage message = NdefMessage();
    message.addUriRecord(url.c_str());

    if (debugMode) {
        Serial.println(F("[NFC] === NFC Write Debug ==="));
        Serial.print(F("[NFC] URL to write: "));
        Serial.println(url);
        Serial.print(F("[NFC] Encoded message size: "));
        Serial.println(message.getEncodedSize());
    }

    // First attempt: write directly (works for already-NDEF-formatted cards)
    Serial.println(F("[NFC] Attempting direct NDEF write..."));
    bool success = nfc.write(message);

