hebertreis/taptosow/esp8266-arduino/src/main.cpp
    if (!success) {
        // Second attempt: format card first (for virgin MIFARE Classic cards)
        // This is needed for blank MIFARE 1K cards to work with iPhone and Android
        Serial.println(F("[NFC] Direct write failed - attempting to format card as NDEF..."));
        displayShowMessage("Formatando", "Cartao virgem...", 500);
        displayShowState(STATE_WRITING);

        bool formatted = nfc.format();
        if (formatted) {
            Serial.println(F("[NFC] Format successful, retrying write..."));
            success = nfc.write(message);
        } else {
            Serial.println(F("[NFC] Format failed - card may not be MIFARE Classic"));
        }
    }

    if (success) {
        Serial.println(F("[NFC] Write successful"));
        Serial.print(F("[NFC] URL written: "));
        Serial.println(url);
        displayShowState(STATE_SUCCESS);
        publishWriteResult(true, url);
        return true;
    } else {
        Serial.println(F("[NFC] Write failed"));
        displayShowState(STATE_ERROR, "Falha na gravacao");
        publishWriteResult(false, "NFC write error - check card type");
        return false;
    }
}

void processNfcTag() {
    Serial.println(F("\n[NFC] Tag detected!"));

    // Step 1: Get UID - RC522 already detected the tag in systemLoop()
    // Just need to select it and read the UID
    MFRC522::StatusCode status;
    MFRC522::Uid uid;
    
    // Get UID size
    uid.size = sizeof(uid.uidByte);
    
    // Select the tag (this also fills uid.uidByte)
    status = mfrc522.PICC_Select(&uid);
    if (status != MFRC522::STATUS_OK) {
        Serial.print(F("[NFC] Select failed: "));
        Serial.println(mfrc522.GetStatusCodeName(status));
        return;
    }

    // Build tag ID from UID
    String tagId = "";
    for (byte i = 0; i < uid.size; i++) {
        if (uid.uidByte[i] < 0x10) tagId += "0";
        tagId += String(uid.uidByte[i], HEX);
        if (i < uid.size - 1) tagId += ":";
    }
    tagId.toUpperCase();

    Serial.print(F("[NFC] Tag UID: "));
    Serial.println(tagId);

    // Tag selected successfully - update state and display
    currentState = STATE_TAG_DETECTED;
    displayShowState(STATE_TAG_DETECTED);

    // Publish tag detection
    publishTagDetected(tagId);

    // Small delay after select
    delay(5);

    // Check if we have pending write command (priority)
    if (hasPendingWriteCommand && pendingTenantId.length() > 0 && 
        pendingSectorId.length() > 0 && pendingUrl.length() > 0) {
        
        // Wait for user to position tag correctly (reduced delay)
        displayShowMessage("Processing", "Keep tag steady...", 300);

        // Attempt write
        bool success = writeNfcTag(pendingTenantId, pendingSectorId, pendingUrl);

        // Clear pending command and reset state
        pendingTenantId = "";
        pendingSectorId = "";
        pendingUrl = "";
        hasPendingWriteCommand = false;

        if (success) {
            currentState = STATE_SUCCESS;
        } else {
            currentState = STATE_ERROR;
        }

        // Wait for tag removal
        Serial.println(F("[NFC] Waiting for tag removal..."));
        displayShowMessage("Complete", "Remove tag now", 0);

        unsigned long waitStart = millis();
        while (nfc.tagPresent() && (millis() - waitStart < 10000)) {
            yield();
            delay(100);
        }

        // Return to read mode (default) or idle
        currentState = readMode ? STATE_READ_MODE : STATE_IDLE;
        displayShowState(currentState);
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
        return;
    }
    
    // Read mode (default) - always transmit tag data to MQTT
    if (readMode || currentState == STATE_READ_MODE) {
        Serial.println(F("[NFC] Read mode - sending tag data"));

        // Extract NDEF URL first (faster)
        String ndefUrl = extractNdefUrl();

        // Send all data including sectors and URL
        publishTagData(tagId, ndefUrl);

        // Wait for tag removal
        waitForTagRemoval();

        // Return to read mode or idle
        currentState = readMode ? STATE_READ_MODE : STATE_IDLE;
        displayShowState(currentState);
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
        return;
    }

    // No mode specified and no pending command - just read and return
    Serial.println(F("[NFC] No pending write command"));
    currentState = STATE_IDLE;
    displayShowState(currentState);

    mfrc522.PICC_HaltA();
    mfrc522.PCD_StopCrypto1();
}

String readTagData() {
    String tagId = "tag_" + String(millis());

    if (debugMode) {
        Serial.println(F("[NFC] === Tag Read Debug ==="));

        // Read UID
        MFRC522::MIFARE_Key key;
        for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;

        MFRC522::Uid uid;
        if (mfrc522.PICC_ReadCardSerial()) {
            uid = mfrc522.uid;

            Serial.print(F("[NFC] Tag UID: "));
            for (byte i = 0; i < uid.size; i++) {
                if (uid.uidByte[i] < 0x10) Serial.print(F("0"));
                Serial.print(uid.uidByte[i], HEX);
                Serial.print(F(" "));
            }
            Serial.println();

            Serial.print(F("[NFC] UID length: "));
            Serial.println(uid.size);

            Serial.print(F("[NFC] Tag type: "));
            Serial.println(mfrc522.PICC_GetTypeName((MFRC522::PICC_Type)uid.sak));

            mfrc522.PICC_HaltA();
        }

        // Try to read NDEF data
        Serial.println(F("[NFC] Attempting to read NDEF data..."));
        NfcTag tag = nfc.read();
        if (tag.hasNdefMessage()) {
            NdefMessage message = tag.getNdefMessage();
            Serial.print(F("[NFC] NDEF records: "));
            Serial.println(message.getRecordCount());

            for (int i = 0; i < message.getRecordCount(); i++) {
                NdefRecord record = message.getRecord(i);
                Serial.print(F("[NFC] Record "));
                Serial.print(i);
                Serial.print(F(" Type: "));

                // Print type as hex bytes
                byte typeLen = record.getTypeLength();
                for (byte j = 0; j < typeLen; j++) {
                    byte b = record.getType()[j];
                    if (b < 0x10) Serial.print(F("0"));
                    Serial.print(b, HEX);
                    Serial.print(F(" "));
                }
                Serial.println();

                String payload = "";
                uint16_t payloadLen = record.getPayloadLength();
                for (uint16_t j = 0; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) payload += c;
                }
                Serial.print(F("[NFC] Payload: "));
                Serial.println(payload);
            }
        } else {
            Serial.println(F("[NFC] No NDEF data or read failed"));
        }

        Serial.println(F("[NFC] ========================"));
    }

    return tagId;
}

String extractNdefUrl() {
    String url = "";
    
    // Try to read NDEF message
    NfcTag tag = nfc.read();
    if (!tag.hasNdefMessage()) {
        Serial.println(F("[NFC] No NDEF message found"));
        return "";
    }
    
    NdefMessage message = tag.getNdefMessage();
    int recordCount = message.getRecordCount();
    
