hebertreis/taptosow/esp8266-arduino/src/main.cpp
    for (int i = 0; i < recordCount; i++) {
        NdefRecord record = message.getRecord(i);
        
        // Check if it's a URI record (type "U" or 0x55)
        byte typeLen = record.getTypeLength();
        if (typeLen == 1 && record.getType()[0] == 0x55) {
            // URI record found
            uint16_t payloadLen = record.getPayloadLength();
            if (payloadLen > 1) {
                byte prefixCode = record.getPayload()[0];
                
                // Get prefix based on code
                String prefix = "";
                if (prefixCode == 0x00) prefix = "";
                else if (prefixCode == 0x01) prefix = "http://www.";
                else if (prefixCode == 0x02) prefix = "https://www.";
                else if (prefixCode == 0x03) prefix = "http://";
                else if (prefixCode == 0x04) prefix = "https://";
                else prefix = "";
                
                // Read the rest of the payload
                for (uint16_t j = 1; j < payloadLen; j++) {
                    char c = record.getPayload()[j];
                    if (c >= 32 && c < 127) {
                        url += c;
                    }
                }
                
                // Add prefix if not already in URL
                if (prefix.length() > 0 && !url.startsWith(prefix)) {
                    url = prefix + url;
                }
                
                Serial.print(F("[NFC] NDEF URL extracted: "));
                Serial.println(url);
                return url;
            }
        }
    }
    
    Serial.println(F("[NFC] No URI record found in NDEF message"));
    return "";
}

String readAllSectorData() {
    MFRC522::MIFARE_Key key;
    for (byte i = 0; i < 6; i++) key.keyByte[i] = 0xFF;
    
    StaticJsonDocument<2048> doc;
    JsonArray sectors = doc.createNestedArray("sectors");
    
    byte buffer[18];
    
    // Read all sectors (0 to 15 for 1K card)
    for (byte sector = 0; sector < SECTOR_COUNT; sector++) {
        JsonObject sectorObj = sectors.createNestedObject();
        sectorObj["sector"] = sector;
        
        JsonArray blocks = sectorObj.createNestedArray("blocks");
        
        // Each sector has 4 blocks (0-3), except sector 15 which may vary
        byte blocksInSector = (sector < 32) ? 4 : 16;
        byte startBlock = sector * 4;
        
        for (byte block = 0; block < blocksInSector; block++) {
            byte blockAddr = startBlock + block;
            
            // Authenticate
            byte status = mfrc522.PCD_Authenticate(MFRC522::PICC_CMD_MF_AUTH_KEY_A, blockAddr, &key, &(mfrc522.uid));
            if (status != MFRC522::STATUS_OK) {
                // Skip unreadable blocks
                continue;
            }
            
            // Read block
            byte size = sizeof(buffer);
            status = mfrc522.MIFARE_Read(blockAddr, buffer, &size);
            
            if (status == MFRC522::STATUS_OK) {
                JsonObject blockObj = blocks.createNestedObject();
                blockObj["block"] = blockAddr;
                
                // Convert to hex string
                String data = "";
                for (byte i = 0; i < 16; i++) {
                    if (buffer[i] < 0x10) data += "0";
                    data += String(buffer[i], HEX);
                    if (i < 15) data += " ";
                }
                blockObj["data"] = data;
                
                // Try to convert to ASCII if printable
                String ascii = "";
                for (byte i = 0; i < 16; i++) {
                    char c = buffer[i];
                    if (c >= 32 && c < 127) ascii += c;
                    else ascii += ".";
                }
                blockObj["ascii"] = ascii;
            }
            
            mfrc522.PICC_HaltA();
            mfrc522.PCD_StopCrypto1();
            yield(); // Prevent watchdog reset
        }
    }
    
    String result;
    serializeJson(doc, result);
    return result;
}

void waitForTagRemoval() {
    Serial.println(F("[NFC] Waiting for tag removal..."));
    displayShowMessage("Complete", "Remove tag now", 0);
    
    unsigned long waitStart = millis();
    while (nfc.tagPresent() && (millis() - waitStart < 10000)) {
        yield();
        delay(100);
    }
}

void nfcInit() {
    Serial.println(F("\n[NFC] Initializing RC522..."));

    // Initialize hardware SPI first
    SPI.begin();
    
    // Initialize RC522
    mfrc522.PCD_Init();
    delay(500); // Wait for RC522 to be ready

    // Set maximum antenna gain
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);

    // Check firmware version
    byte version = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
    Serial.print(F("[NFC] RC522 Firmware Version: 0x"));
    Serial.println(version, HEX);

    // Store firmware version globally
    nfcFirmwareVersion = version;

    if (version == 0x00 || version == 0xFF) {
        Serial.println(F("[NFC] WARNING: RC522 not found or not responding!"));
        Serial.println(F("[NFC] Check wiring: SS=D8, RST=D3"));
        Serial.println(F("[NFC] Note: On HW-364A, SPI shares pins with OLED I2C"));
        isNfcConnected = false;
        displayShowMessage("NFC Error", "RC522 not found", 3000);
    } else {
        Serial.println(F("[NFC] RC522 initialized successfully"));
        isNfcConnected = true;
        // Test tag detection
        Serial.println(F("[NFC] Testing tag detection..."));
        byte bufferATQA[2];
        byte bufferSize = sizeof(bufferATQA);
        MFRC522::StatusCode status = mfrc522.PICC_RequestA(bufferATQA, &bufferSize);
        if (status == MFRC522::STATUS_OK) {
            Serial.println(F("[NFC] Tag detected during test!"));
        } else {
            Serial.print(F("[NFC] No tag present (status: "));
            Serial.println(mfrc522.GetStatusCodeName(status));
            Serial.println(F(") - This is normal if no tag is near"));
        }

        displayShowMessage("NFC OK", "Ready to write", 1000);
    }
}

// ============================================================================
// SYSTEM FUNCTIONS
// ============================================================================

